dictDoubleWord = ['가', '갸', '거', '겨', '고', '교', '구', '규', '그', '기', '개', '걔', '게', '계', '과', '괘', '궈', '궤', '괴', '귀', '긔', '까', '꺄', '꺼', '껴', '꼬', '꾜', '꾸', '뀨', '끄', '끼', '깨', '께', '꼐', '꽈', '꽤', '꿔', '꿰', '꾀', '뀌',
                  '나', '냐', '너', '녀', '노', '뇨', '누', '뉴', '느', '니', '내', '네', '녜', '놔', '눠', '눼', '뇌', '뉘', '늬',
                  '다', '댜', '더', '뎌', '도', '됴', '두', '듀', '드', '디', '대', '데', '뎨', '돠', '돼', '둬', '뒈', '되', '뒤', '듸', '따', '떠', '뗘', '또', '뚜', '뜨', '띠', '때', '떼', '똬', '뙈', '뛔', '뙤', '뛰', '띄',
                  '라', '랴', '러', '려', '로', '료', '루', '류', '르', '리', '래', '레', '례', '롸', '뤄', '뤠', '뢰', '뤼',
                  '마', '먀', '머', '며', '모', '묘', '무', '뮤', '므', '미', '매', '메', '몌', '뫄', '뭐', '뭬', '뫼', '뮈',
                  '바', '뱌', '버', '벼', '보', '뵤', '부', '뷰', '브', '비', '배', '베', '볘', '봐', '봬', '붜', '붸', '뵈', '뷔', '빠', '뺘', '뻐', '뼈', '뽀', '뾰', '뿌', '쀼', '쁘', '삐', '빼', '뻬', '뾔',
                  '사', '샤', '서', '셔', '소', '쇼', '수', '슈', '스', '시', '새', '섀', '세', '셰', '솨', '쇄', '숴', '쉐', '쇠', '쉬', '싸', '써', '쏘', '쑈', '쑤', '쓰', '씨', '쌔', '쎄', '쏴', '쐐', '쒀', '쒜', '쐬', '쒸', '씌',
                  '아', '야', '어', '여', '오', '요', '우', '유', '으', '이', '애', '얘', '에', '예', '와', '왜', '워', '웨', '외', '위', '의',
                  '자', '쟈', '저', '져', '조', '죠', '주', '쥬', '즈', '지', '재', '쟤', '제', '졔', '좌', '좨', '줘', '줴', '죄', '쥐', '짜', '쨔', '쩌', '쪄', '쪼', '쭈', '쮸', '쯔', '찌', '째', '쩨', '쫘', '쫴', '쭤', '쬐', '쮜',
                  '차', '챠', '처', '쳐', '초', '쵸', '추', '츄', '츠', '치', '채', '체', '쳬', '촤', '춰', '췌', '최', '취',
                  '카', '캬', '커', '켜', '코', '쿄', '쿠', '큐', '크', '키', '캐', '케', '켸', '콰', '쾌', '쿼', '퀘', '쾨', '퀴',
                  '타', '탸', '터', '텨', '토', '툐', '투', '튜', '트', '티', '태', '테', '톄', '톼', '퇘', '퉈', '퉤', '퇴', '튀', '틔',
                  '파', '퍄', '퍼', '펴', '포', '표', '푸', '퓨', '프', '피', '패', '페', '폐', '퐈', '풔', '푀', '퓌',
                  '하', '햐', '허', '혀', '호', '효', '후', '휴', '흐', '히', '해', '헤', '혜', '화', '홰', '훠', '훼', '회', '휘', '희']


def isKorLetter(letter):
    order = ord(letter.lower())
    if ord('가') <= order <= ord('힣') or ord('ㄱ') <= order <= ord('ㆌ'):
        return True

    else:
        return False


def wrap(string):
    string += 'a'
    res_str = ''
    prev = 'a'
    prevIsKor = False
    index = 0
    key = ''
    replacement = dict()

    for letter in string:
        isKor = isKorLetter(letter)

        if prevIsKor and not isKor:
            if prev in dictDoubleWord:
                rep = f'${index}p$'
            else:
                rep = f'${index}n$'

            res_str += rep
            replacement[rep] = key

            index += 1
            key = ''


        if isKor:
            key += letter
        else:
            res_str += letter

        prev = letter
        prevIsKor = isKor

    res_str = res_str[:-1]
    return res_str, replacement


